[
    {
      "nombre": "El senor de los anillos",
      "descripcion": "La novela narra el viaje del protagonista principal, Frodo Bolsón, hobbit de la Comarca, para destruir el Anillo Único y la consiguiente guerra que provocará el enemigo para recuperarlo, ya que es la principal fuente de poder de su creador, el Señor oscuro, Sauron.",
      "codigo": "12",
      "foto": "https://planetadelibroscom.cdnstatics2.com/usuaris/libros/fotos/210/m_libros/portada_el-senor-de-los-anillos_j-r-r-tolkien_201601252224.jpg",
      "precio": "1200",
      "stock": "1",
      "id": 1,
      "timestamp": 1641739101230
    },
    {
      "nombre": "Harry Potter y la Piedra Filosofal",
      "descripcion": "Harry Potter se ha quedado huérfano y vive en casa de sus abominables tíos y el insoportable primo Dudley. Harry se siente muy triste y solo, hasta que un buen día recibe una carta que cambiará su vida para siempre.",
      "codigo": "13",
      "foto": "https://planetadelibroscom.cdnstatics2.com/usuaris/libros/fotos/48/m_libros/47740_1_lostesorosdeharrypotter.jpg",
      "precio": "2200",
      "stock": "20",
      "id": 2,
      "timestamp": 1641739101230
    },
    {
      "nombre": "El patron Bitcoin",
      "descripcion": "El patrón Bitcoin analiza el contexto histórico del surgimiento de esta nueva moneda, las propiedades económicas que la han permitido crecer rápidamente y sus implicaciones económicas, políticas y sociales.",
      "codigo": "15",
      "foto": "https://planetadelibroscom.cdnstatics2.com/usuaris/libros/fotos/344/m_libros/portada_el-patron-bitcoin_saifedean-ammous_202111181133.jpg",
      "precio": "3000",
      "stock": "30",
      "id": 3,
      "timestamp": 1641739101230
    },
    {
      "nombre": "Ami, el niño de las estrellas",
      "descripcion": "es una trilogía de libros escritor por el autor Enrique Barrios, también creador de libros como \"El maravilloso universo de la magia\", \"Maravilla\", \"Cuentos de Amor, estrellas y almas gemelas\", \"Ami y Perlita\", \"Dios para locos bajitos\", \"El libro de Dios Amor\", \"Carta de Dios para ti\", \"proyecto elevación\" y \"El color de las aguas\".",
      "codigo": "12221",
      "foto": "https://images-na.ssl-images-amazon.com/images/I/41fQJSGOWsL._SY291_BO1,204,203,200_QL40_FMwebp_.jpg",
      "precio": "4750",
      "stock": "40",
      "id": 4,
      "timestamp": 1641739101230
    },
    {
      "nombre": "The Fiat Standard",
      "descripcion": "World-renowned economist Saifedean Ammous applies his unique analytical lens to the fiat monetary system, explaining it as a feat of engineering and technology just as he did for bitcoin in his global bestseller The Bitcoin Standard.",
      "codigo": "1554",
      "foto": "https://m.media-amazon.com/images/I/41ZTv9g6BxL.jpg",
      "precio": "3500",
      "stock": "20",
      "timestamp": 1641739101230,
      "id": 5
    },
    {
      "nombre": "Arte De La Guerra Sun Tzu",
      "descripcion": "El arte de la guerra es el más reconocido tratado de estrategia militar de todos los tiempos. A pesar de haber sido escrito, presumiblemente, en el siglo V a.C., las ideas estipuladas por Sun Tzu mantienen plena vigencia y actualidad, puesto que los trece capítulos que componen la presenta obra transmiten una sabiduría difícilmente superable.",
      "codigo": "1133",
      "foto": "https://d2r9epyceweg5n.cloudfront.net/stores/328/733/products/arteguerra1-e3385b582bc292306215538838739421-640-0.jpg",
      "precio": "1750",
      "stock": "3",
      "timestamp": 1641739101230,
      "id": 6
    },
    {
      "nombre": "Cancion de Hielo y Fuego",
      "descripcion": "Considerada como un todo, esta serie constituye una genuina obra maestra de la fantasía moderna, poniendo al alcance de los lectores lo mejor que el género tiene que ofrecer. Magia, misterio, intriga, romance y aventura inundan estas páginas y nos transportan a un mundo que nunca habíamos imaginado Juego de tronos es la primera entrega de Canción de hielo y fuego, la serie que ha roto con todos los tópicos de la fantasía moderna. ",
      "codigo": "1254",
      "foto": "https://images.cdn3.buscalibre.com/fit-in/360x360/4c/1a/4c1a1663350e155af145d04109b39138.jpg",
      "precio": "950",
      "stock": "12",
      "timestamp": 1641739101230,
      "id": 7
    },
    {
      "nombre": "Los Juegos del Hambre. Balada de Pájaros Cantores y Serpientes",
      "descripcion": "Es la mañana de la cosecha que dará comienzo a los décimos Juegos del Hambre. En el Capitolio; Coriolanus Snow; de dieciocho años; se prepara para una oportunidad única: alcanzar la gloria como mentor de los Juegos. La casa de los Snow; antes tan influyente; atraviesa tiempos difíciles; y su destino depende de que Coriolanus consiga superar a sus compañeros en ingenio; estrategia y encanto como mentor del tributo que le sea adjudicado.",
      "codigo": "1255",
      "foto": "https://images.cdn3.buscalibre.com/fit-in/360x360/0a/a3/0aa3c5b8d6ae27c1c2c5c1e138796666.jpg",
      "precio": "435",
      "stock": "5",
      "timestamp": 1641739101230,
      "id": 8
    },
    {
      "nombre": "La Canción de Aquiles",
      "descripcion": "Grecia en la era de los héroes. Patroclo, un príncipe joven y torpe, ha sido exiliado al reino de Ftía, donde vive a la sombra del rey Peleo y su hijo divino, Aquiles.Aquiles, el mejor de los griegos, es todo lo que no es Patroclo: fuerte, apuesto, hijo de una diosa. Un día Aquiles toma bajo su protección al lastimoso príncipe y ese vínculo provisional da paso a una sólida amistad mientras ambos se convierten en jóvenes habilidosos en las artes de la guerra.",
      "codigo": "1256",
      "foto": "https://images.cdn3.buscalibre.com/fit-in/360x360/2f/f6/2ff68dc5f77748130fc31b863abee36a.jpg",
      "precio": "1700",
      "stock": "8",
      "timestamp": 1641739101230,
      "id": 9
    },
    {
      "nombre": "Harry Potter y la Orden Del Fenix",
      "descripcion": "Una edición única que no puedes perderte si alguna vez te has imaginado sentado en el Gran Comedor de Hogwarts, durante la Ceremonia de Selección, a punto de escuchar el veredicto del Sombrero Seleccionador.",
      "codigo": "1257",
      "foto": "https://images.cdn1.buscalibre.com/fit-in/360x360/95/dd/95dd90be0b0c85b7dabc617e8262136c.jpg",
      "precio": "2800",
      "stock": "9",
      "timestamp": 1641739189343,
      "id": 10
    }
  ]